Template_Cases/LaNi5_Desorption/system/metalArea/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/hydrideArea";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(T|p|rhoMetal)"
    {
        solver            smoothSolver;
        smoother          symGaussSeidel;
        tolerance         1e-6;
        relTol            0;
    }
}


SIMPLE
{
    nNonOrthogonalCorrectors 0;
}

// ************************************************************************* //
